# DimStyleSuppressSpaces Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DimStyleSuppressSpaces Property
ParameterTypeId Class See Also
---
"Suppress Spaces"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DimStyleSuppressSpaces { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimStyleSuppressSpaces As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DimStyleSuppressSpaces {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace